#include <stdio.h>
#include <string.h>
int main() {
//数组 

     char* c = "abc" ;
     printf("%p\n",&c);//指针的地址
     printf("%p\n",c);//指针的地址-- 指向的值
     c = "cctv"; //指向的地址不变，改变指向地址中的值

     printf("%p\n",&c);//指针的地址
     printf("%p\n",c);//指针的地址-- 指向的值
    printf("%s\n",c);//指针的地址--> 指向的值(也是地址)--指向的值(地址--值)
 /**
  * 内存变化图
  *         0x111         0x113  0x114  0x115   0x116
  *        ________       ____________________ 
  * str -->|0x112 |-----> | a    | b    |  c |   \0  |
  *        --------       ---------------------
  *     
  * *       0x111         0x119  0x11a  0x11b  0x11c    0x11d
  *        ________       ____________________ 
  * str -->|0x118 |-----> | c   | c    |  t |    v    | \0  |
  *        --------       ---------------------
  *       
  *       
  * 
  **/
     getchar();
 
}

